toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
// MARK: - Power

static void _VDDIMGSDEnabledChanged() {
    if (_VDDIMGSDEnabled::Asserted()) {
        _Pin::VDD_B_2V8_IMG_SD_EN::Write(1);
        _Scheduler::Sleep(_Scheduler::Us<100>); // 100us delay needed between power on of VAA (2V8) and VDD_IO (1V8)
        _Pin::VDD_B_1V8_IMG_SD_EN::Write(1);
        
        // Rails take ~1ms to turn on, so wait 2ms to be sure
        _Scheduler::Sleep(_Scheduler::Ms<2>);
    
    } else {
        // No delay between 2V8/1V8 needed for power down (per AR0330CS datasheet)
        _Pin::VDD_B_2V8_IMG_SD_EN::Write(0);
        _Pin::VDD_B_1V8_IMG_SD_EN::Write(0);
        
        // Rails take ~1.5ms to turn off, so wait 2ms to be sure
        _Scheduler::Sleep(_Scheduler::Ms<2>);
    }
}

// MARK: - ICE40

template<>
void _ICE::Transfer(const Msg& msg, Resp* resp) {
    AssertArg((bool)resp == (bool)(msg.type & _ICE::MsgType::Resp));
    _SPI::WriteRead(msg, resp);
}

static void _ICEInit() {
    bool ok = false;
    for (int i=0; i<100 && !ok; i++) {
        _Scheduler::Sleep(_Scheduler::Ms<1>);
        // Reset ICE comms (by asserting SPI CLK for some length of time)
        _SPI::ICEReset();
        // Init ICE comms
        ok = _ICE::Init();
    }
    Assert(ok);
}

// MARK: - _TaskPower

#define _TaskPowerStackSize 128

SchedulerStack(".stack._TaskPower")
uint8_t _TaskPowerStack[_TaskPowerStackSize];

asm(".global _StartupStack");
asm(".equ _StartupStack, _TaskPowerStack+" Stringify(_TaskPowerStackSize));

struct _TaskPower {
    static void Run() {
        // Disable interrupts because _Init() and _Wired require it
        Toastbox::IntState ints(false);
        
        _Init();
        
        for (;;) {
            // Wait until something triggers us to update
            _Scheduler::Wait([] { return _Wired()!=_WiredMonitor::Wired() || _BatteryLevelUpdate; });
            
            // Update our wired state
            _Wired(_WiredMonitor::Wired());
            
            if (_BatteryLevelUpdate) {
                // Update our battery level
                _BatteryLevel = _BatterySampler::Sample();
                
                // Update our state
                _RTCCounter = _SampleIntervalRTC;
                _CaptureCounter = _SampleIntervalCapture;
                _BatteryLevelUpdate = false;
            }
        }
    }
    
    static MSP::BatteryLevel BatteryLevelGet() {
        return _BatteryLevel;
    }
    
    static void BatteryLevelUpdate() {
        _BatteryLevelUpdate = true;
    }
    
    static void BatteryLevelWait() {
        _Scheduler::Wait([] { return !_BatteryLevelUpdate; });
    }
    
    static bool On() {
        return _On();
    }
    
    static void ButtonHold() {
        // Allow the button to turn us on if we're not in battery trap, or we're wired
        if (!_BatteryTrap() || _Wired()) _On(!_On());
        // Otherwise, deny the request by flashing the red LEDs
        else _LEDFlash(_LEDRed_);
    }
    
    static void CaptureNotify() {
        // Short-circuit if we're in battery trap
        // We don't want to monitor the battery while we're in battery trap, to minimize battery use
        if (_BatteryTrap()) return;
        
        _CaptureCounter--; // Rollover OK since we reset _CaptureCounter in Run()
        if (!_CaptureCounter) {
            BatteryLevelUpdate();
            BatteryLevelWait();
        }
    }
    
    static bool ISRRTC() {
        // Short-circuit if we're in battery trap
        // We don't want to monitor the battery while we're in battery trap, to minimize battery use
        if (_BatteryTrap()) return false;
        
        _RTCCounter--; // Rollover OK since we reset _RTCCounter in Run()
        if (!_RTCCounter) {
            BatteryLevelUpdate();
            return true;
        }
        return false;
    }
    
    // _Init(): initialize system
    //
    // Ints: disabled
    //   Rationale: GPIO::Init() and _RTC::Init() require it, and in general we don't want
    //   interrupts to fire while we configure our other subsystems
    static void _Init() {
        // Init watchdog first
        _Watchdog::Init();
        
        // Init GPIOs
        GPIO::Init<
            // Power control
            _Pin::VDD_B_EN,
            _Pin::VDD_B_1V8_IMG_SD_EN,
            _Pin::VDD_B_2V8_IMG_SD_EN,
            
            // Clock (config chosen by _Clock)
            _Clock::Pin::XIN,
            _Clock::Pin::XOUT,
            
            // SPI (config chosen by _SPI)
            _SPI::Pin::Clk,
            _SPI::Pin::DataOut,
            _SPI::Pin::DataIn,
            
            // I2C (config chosen by _I2C)
            _I2C::Pin::SCL,
            _I2C::Pin::SDA,
            
            // Motion (config chosen by _Motion)
            _Motion::Pin::Power,
            _Motion::Pin::Signal,
            
            // Battery (config chosen by _BatterySampler)
            _BatterySampler::Pin::BatChrgLvlPin,
            _BatterySampler::Pin::BatChrgLvlEn_Pin,
            
            // Button (config chosen by _Button)
            _Button::Pin,
            
            // Wired
            _WiredMonitor::Pin,
            
            // LEDs
            _Pin::LED_GREEN_,
            _Pin::LED_RED_
        
        >(Startup::ColdStart());
        
        // Init clock
        _Clock::Init();
        
//        _Pin::LED_RED_::Write(1);
//        for (;;) {
//            _Pin::LED_RED_::Write(1);
//            __delay_cycles(1000000);
//            _Pin::LED_RED_::Write(0);
//            __delay_cycles(1000000);
//        }
        
//        _Pin::LED_RED_::Write(1);
//        _Pin::LED_GREEN_::Write(1);
//        for (;;) {
//            _Pin::LED_RED_::Write(0);
//            __delay_cycles(1000000);
//            _Pin::LED_RED_::Write(1);
//            __delay_cycles(1000000);
//        }
        
//        _Pin::LED_RED_::Write(1);
//        _Pin::LED_GREEN_::Write(1);
//        for (;;) {
//            _Pin::LED_RED_::Write(0);
////            __delay_cycles(1000000);
//            _Scheduler::Delay(_Scheduler::Ms<100>);
//            _Pin::LED_RED_::Write(1);
////            __delay_cycles(1000000);
//            _Scheduler::Delay(_Scheduler::Ms<100>);
//        }
        
        // Init RTC
        // We need RTC to be unconditionally enabled for 2 reasons:
        //   - We want to track relative time (ie system uptime) even if we don't know the wall time.
        //   - RTC must be enabled to keep BAKMEM alive when sleeping. If RTC is disabled, we enter
        //     LPM4.5 when we sleep (instead of LPM3.5), and BAKMEM is lost.
        _RTC::Init();
        
        // Init LEDs by setting their default-priority / 'backstop' values to off.
        // This is necessary so that relinquishing the LEDs from I2C task causes
        // them to turn off. If we didn't have a backstop value, the LEDs would
        // remain in whatever state the I2C task set them to before relinquishing.
        _LEDGreen_.set(_LEDPriority::Default, 1);
        _LEDRed_.set(_LEDPriority::Default, 1);
        
        // Init BatterySampler
        _BatterySampler::Init();
        
