toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
        // Start tasks
        _Scheduler::Start<_TaskI2C, _TaskMotion, _TaskButton>();
        
        // Restore our saved power state
        _State = _TaskPowerStateSaved;
        
        // Trigger a battery level update when first starting
        BatteryLevelUpdate();
    }
    
    static void _StateChanged() {
        // Blink LEDs if our on state changed
        const bool on = _State & _StateOn;
        const bool onPrev = _TaskPowerStateSaved & _StateOn;
        if (!onPrev && on) _LEDFlash(_LEDGreen_);
        else if (onPrev && !on) _LEDFlash(_LEDRed_);
        _TaskPowerStateSaved = _State;
    }
    
    static bool _On() {
        return _State & _StateOn;
    }
    
    static void _On(bool x) {
        // Short-circuit if our state didn't change
        if (x == _On()) return;
        if (x) _State = _State |  _StateOn;
        else   _State = _State & ~_StateOn;
    }
    
    static bool _Wired() {
        return _State & _StateWired;
    }
    
    static void _Wired(bool x) {
        // Short-circuit if our state didn't change
        if (x == _Wired()) return;
        if (x) {
            // When entering the Wired state, turn ourself on
            _State = _State | _StateOn | _StateWired;
        } else {
            // When exiting the Wired state, also exit the On state if we're in the BatteryTrap state
            if (_BatteryTrap()) {
                _State = _State & ~(_StateOn|_StateWired);
            } else {
                _State = _State & ~_StateWired;
            }
        }
    }
    
    static bool _BatteryTrap() {
        return _State & _StateBatteryTrap;
    }
    
    static void _BatteryTrap(bool x) {
        // Short-circuit if our state didn't change
        if (x == _BatteryTrap()) return;
        if (x) _State = _State |  _StateBatteryTrap;
        else   _State = _State & ~_StateBatteryTrap;
    }
    
    static void _BatteryTrapUpdate() {
        // If our battery level drops below the Enter threshold, enter battery trap
        if (_BatteryLevel <= _BatteryTrapLevelEnter) {
            _BatteryTrap(true);
        
        // If our battery level raises above the Exit threshold, exit battery trap
        } else if (_BatteryLevel >= _BatteryTrapLevelExit) {
            _BatteryTrap(false);
        }
    }
    
    static void _LEDFlickerEnabledUpdate() {
        _LEDFlickerEnabled = _BatteryTrap() && !_Wired() && !_LEDFlashing;
    }
    
    static void _LEDFlickerEnabledChanged() {
        _LEDFlicker::Enabled(_LEDFlickerEnabled);
    }
    
    static void _LEDFlash(OutputPriority& led) {
        _LEDFlashing = true;
        
        // Turn off both LEDs
        _LEDGreen_.set(_LEDPriority::Power, 1);
        _LEDRed_.set(_LEDPriority::Power, 1);
        _Scheduler::Delay(_Scheduler::Ms<100>);
        
        // Flash red LED to signal that we're turning off
        for (int i=0; i<5; i++) {
            led.set(_LEDPriority::Power, 0);
            _Scheduler::Delay(_Scheduler::Ms<50>);
            led.set(_LEDPriority::Power, 1);
            _Scheduler::Delay(_Scheduler::Ms<50>);
        }
        
        // Relinquish both LEDs
        _LEDGreen_.set(_LEDPriority::Power, std::nullopt);
        _LEDRed_.set(_LEDPriority::Power, std::nullopt);
        _Scheduler::Delay(_Scheduler::Ms<100>);
        
        _LEDFlashing = false;
    }
    
    static constexpr uint8_t _StateOff          = 0;
    static constexpr uint8_t _StateOn           = 1<<0;
    static constexpr uint8_t _StateBatteryTrap  = 1<<1;
    static constexpr uint8_t _StateWired        = 1<<2;
    
    static constexpr uint16_t _SampleIntervalRTCDays = 4;
    static constexpr uint16_t _SampleIntervalRTC     = (_SampleIntervalRTCDays * Time::Day) / _RTC::InterruptIntervalTicks;
    static constexpr uint16_t _SampleIntervalCapture = 512;
    
    static constexpr uint8_t _BatteryTrapPercentEnter = 2;
    static constexpr uint8_t _BatteryTrapPercentExit  = 10;
    
    static constexpr MSP::BatteryLevel _BatteryTrapLevelEnter
        = MSP::BatteryLevelMin + ((((uint32_t)MSP::BatteryLevelMax-MSP::BatteryLevelMin)*_BatteryTrapPercentEnter)/100);
    static constexpr MSP::BatteryLevel _BatteryTrapLevelExit
        = MSP::BatteryLevelMin + ((((uint32_t)MSP::BatteryLevelMax-MSP::BatteryLevelMin)*_BatteryTrapPercentExit)/100);
    
    static_assert(_SampleIntervalRTC     == 168);  // Debug
    static_assert(_BatteryTrapLevelEnter == 1311); // Debug
    static_assert(_BatteryTrapLevelExit  == 6554); // Debug
    
    static inline uint16_t _RTCCounter = 0;
    static inline uint16_t _CaptureCounter = 0;
    
    static inline T_Property<MSP::BatteryLevel,_BatteryTrapUpdate> _BatteryLevel = MSP::BatteryLevelInvalid;
    static inline bool _BatteryLevelUpdate = false;
    
    static inline T_Property<uint8_t,_StateChanged,_EventsEnabledUpdate,_LEDFlickerEnabledUpdate> _State = _StateOff;
    
    // _LEDFlashing: whether we're currently flashing the LEDs manually
    static inline T_Property<bool,_LEDFlickerEnabledUpdate> _LEDFlashing;
    
    // _LEDFlickerEnabled: whether the LED should flicker periodically (due to battery trap)
    static inline T_Property<bool,_LEDFlickerEnabledChanged> _LEDFlickerEnabled;
    
    static constexpr uint32_t _FlickerPeriodMs      = 5000;
    static constexpr uint32_t _FlickerOnDurationMs  = 20;
    using _LEDFlicker = T_LEDFlicker<_Pin::LED_GREEN_, _ACLKFreqHz, _FlickerPeriodMs, _FlickerOnDurationMs>;
    
    // Task stack
    static constexpr auto& Stack = _TaskPowerStack;
};

// MARK: - _TaskI2C

struct _TaskI2C {
    static void Run() {
        for (;;) {
            // Wait until STM is up (ie we're plugged in)
            _Scheduler::Wait([] { return _WiredMonitor::Wired(); });
            
            _I2C::Init();
            
            for (;;) {
                // Wait for a command
                MSP::Cmd cmd;
                bool ok = _I2C::Recv(cmd);
                if (!ok) break;
                
                // Handle command
                const MSP::Resp resp = _CmdHandle(cmd);
                
                // Send response
                ok = _I2C::Send(resp);
                if (!ok) break;
            }
            
