toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
            // Cleanup
            
            // Relinquish LEDs, which may have been set by _CmdHandle()
            _LEDRed_.set(_LEDPriority::I2C, std::nullopt);
            _LEDGreen_.set(_LEDPriority::I2C, std::nullopt);
            
            // Reset state
            _HostModeState = {};
        }
    }
    
    static void WiredChanged() {
        // If we became unwired, restart our I2C state machine
        if (!_WiredMonitor::Wired()) _I2C::Abort();
    }
    
    static MSP::Resp _CmdHandle(const MSP::Cmd& cmd) {
        using namespace MSP;
        switch (cmd.op) {
        case Cmd::Op::None:
            return MSP::Resp{ .ok = false };
        
        case Cmd::Op::StateRead: {
            const size_t off = cmd.arg.StateRead.off;
            if (off > sizeof(::_State)) return MSP::Resp{ .ok = false };
            const size_t rem = sizeof(::_State)-off;
            const size_t len = std::min(rem, sizeof(MSP::Resp::arg.StateRead.data));
            MSP::Resp resp = { .ok = true };
            memcpy(resp.arg.StateRead.data, (uint8_t*)&::_State+off, len);
            return resp;
        }
        
        case Cmd::Op::StateWrite: {
            const size_t off = cmd.arg.StateWrite.off;
            if (off > sizeof(::_State)) return MSP::Resp{ .ok = false };
            FRAMWriteEn writeEn; // Enable FRAM writing
            const size_t rem = sizeof(::_State)-off;
            const size_t len = std::min(rem, sizeof(MSP::Cmd::arg.StateWrite.data));
            memcpy((uint8_t*)&::_State+off, cmd.arg.StateWrite.data, len);
            return MSP::Resp{ .ok = true };
        }
        
        case Cmd::Op::LEDSet:
            _LEDRed_.set(_LEDPriority::I2C, !cmd.arg.LEDSet.red);
            _LEDGreen_.set(_LEDPriority::I2C, !cmd.arg.LEDSet.green);
            return MSP::Resp{ .ok = true };
        
        case Cmd::Op::TimeGet:
            return MSP::Resp{
                .ok = true,
                .arg = { .TimeGet = { .state = _RTC::TimeState() } },
            };
        
        case Cmd::Op::TimeSet:
            // Only allow setting the time while we're in host mode
            // and therefore _TaskEvent isn't running
            if (!_HostModeState.en) return MSP::Resp{ .ok = false };
            _RTC::Init(&cmd.arg.TimeSet.state);
            return MSP::Resp{ .ok = true };
        
        case Cmd::Op::TimeAdjust:
            // Only allow setting the time while we're in host mode
            // and therefore _TaskEvent isn't running
            if (!_HostModeState.en) return MSP::Resp{ .ok = false };
            _RTC::Adjust(cmd.arg.TimeAdjust.adjustment);
            return MSP::Resp{ .ok = true };
        
        case Cmd::Op::HostModeSet:
            if (cmd.arg.HostModeSet.en) {
                _HostModeState.en = true;
            } else {
                // Clear entire _HostModeState when exiting host mode
                _HostModeState = {};
            }
            return MSP::Resp{ .ok = true };
        
        case Cmd::Op::VDDIMGSDSet:
            if (!_HostModeState.en) return MSP::Resp{ .ok = false };
            _HostModeState.vddImgSd = cmd.arg.VDDIMGSDSet.en;
            return MSP::Resp{ .ok = true };
        
        case Cmd::Op::BatteryLevelGet: {
            _TaskPower::BatteryLevelUpdate();
            _TaskPower::BatteryLevelWait();
            return MSP::Resp{
                .ok = true,
                .arg = { .BatteryLevelGet = { .level = _TaskPower::BatteryLevelGet() } },
            };
        }}
        
        return MSP::Resp{ .ok = false };
    }
    
    static bool HostModeEnabled() {
        return _HostModeState.en;
    }
    
    static inline struct {
        T_Property<bool,_EventsEnabledUpdate> en;
        _VDDIMGSDEnabled::Assertion vddImgSd;
    } _HostModeState;
    
    // Task stack
    SchedulerStack(".stack._TaskI2C")
    static inline uint8_t Stack[256];
};

// MARK: - _TaskSD

//static void debugSignal() {
//    _Pin::DEBUG_OUT::Init();
//    for (;;) {
////    for (int i=0; i<10; i++) {
//        _Pin::DEBUG_OUT::Write(0);
//        for (volatile int i=0; i<10000; i++);
//        _Pin::DEBUG_OUT::Write(1);
//        for (volatile int i=0; i<10000; i++);
//    }
//}

struct _TaskSD {
    static void Reset() {
        // Reset our state
        _State = {};
    }
    
    static void CardReset() {
        Wait();
        _Scheduler::Start<_TaskSD>([] { _CardReset(); });
    }
    
    static void CardInit() {
        Wait();
        _Scheduler::Start<_TaskSD>([] { _CardInit(); });
    }
    
    static void Write(uint8_t srcRAMBlock) {
        Wait();
        _State.writing = true;
        
        static struct { uint8_t srcRAMBlock; } Args;
        Args = { srcRAMBlock };
        _Scheduler::Start<_TaskSD>([] { _Write(Args.srcRAMBlock); });
    }
    
    static void Wait() {
        _Scheduler::Wait<_TaskSD>();
    }
    
    // SDStateReady(): returns whether we're done initializing _State.sd
    static bool SDStateReady() {
        return (bool)_State.rca;
    }
    
    static bool Writing() {
        return _State.writing;
    }
    
//    static void WaitForInit() {
//        _Scheduler::Wait([&] { return _RCA.has_value(); });
//    }
    
    static void _CardReset() {
        _SDCard::Reset();
    }
    
    static void _CardInit() {
        if (!_State.rca) {
            // We haven't successfully enabled the SD card since _TaskSD::Reset();
            // enable the SD card and get the card id / card data.
            SD::CardId cardId;
            SD::CardData cardData;
            _State.rca = _SDCard::Init(&cardId, &cardData);
            
            // If SD state isn't valid, or the existing SD card id doesn't match the current
            // card id, reset the SD state.
            if (!::_State.sd.valid || memcmp(&::_State.sd.cardId, &cardId, sizeof(cardId))) {
                _SDStateInit(cardId, cardData);
            
            // Otherwise the SD state is valid and the SD card id matches, so init the ring buffers.
            } else {
                _ImgRingBufInit();
            }
        
        } else {
            // We've previously enabled the SD card successfully since _TaskSD::Reset();
            // enable it again
            _SDCard::Init();
        }
    }
    
    static void _Write(uint8_t srcRAMBlock) {
        const MSP::ImgRingBuf& imgRingBuf = ::_State.sd.imgRingBufs[0];
        
        // Copy full-size image from RAM -> SD card
        {
            const SD::Block block = MSP::SDBlockFull(::_State.sd.baseFull, imgRingBuf.buf.idx);
            _SDCard::WriteImage(*_State.rca, srcRAMBlock, block, Img::Size::Full);
        }
        
        // Copy thumbnail from RAM -> SD card
        {
            const SD::Block block = MSP::SDBlockThumb(::_State.sd.baseThumb, imgRingBuf.buf.idx);
            _SDCard::WriteImage(*_State.rca, srcRAMBlock, block, Img::Size::Thumb);
        }
        
