toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
            header.coarseIntTime = _State.autoExp.integrationTime();
            header.id = id;
            header.timestamp = _RTC::Now();
            
            // Capture an image to RAM
            #warning TODO: optimize the header logic so that we don't set the magic/version/imageWidth/imageHeight every time, since it only needs to be set once per ice40 power-on
            const _ICE::ImgCaptureStatusResp resp = _ICE::ImgCapture(header, expBlock, skipCount);
            const uint8_t expScore = _State.autoExp.update(resp.highlightCount(), resp.shadowCount());
            if (!bestExpScore || (expScore > bestExpScore)) {
                bestExpBlock = expBlock;
                bestExpScore = expScore;
            }
            
            // We're done if we don't have any exposure changes
            if (!_State.autoExp.changed()) break;
            
            // Update the exposure
            _ImgSensor::SetCoarseIntTime(_State.autoExp.integrationTime());
        }
        
        _State.captureBlock = bestExpBlock;
    }
    
    static inline struct __State {
        __State() {} // Compiler bug workaround
        uint8_t captureBlock = 0;
        // _AutoExp: auto exposure algorithm object
        Img::AutoExposure autoExp;
    } _State;
    
    // Task stack
    SchedulerStack(".stack._TaskImg")
    static inline uint8_t Stack[256];
};

// MARK: - _TaskEvent

struct _TaskEvent {
    static void Start() {
        _Scheduler::Start<_TaskEvent>();
    }
    
    static void Reset() {
        // Reset our timer
        _EventTimer::Schedule(std::nullopt);
        // Reset other tasks' state
        // This is necessary because we're stopping them at an arbitrary point
        _TaskSD::Reset();
        _TaskImg::Reset();
        // Stop tasks
        _Scheduler::Stop<_TaskSD, _TaskImg, _TaskEvent>();
        // Reset our state
        // We do this last so that our power assertions are reset last
        _State = {};
    }
    
    static bool ISRRTC() {
        return _EventTimer::ISRRTC();
    }
    
    static bool ISRTimer(uint16_t iv) {
        return _EventTimer::ISRTimer(iv);
    }
    
    static void _TimeTrigger(_Triggers::TimeTriggerEvent& ev) {
        _Triggers::TimeTrigger& trigger = ev.trigger();
        // Schedule the CaptureImageEvent, but only if we're not in fast-forward mode
        if (_State.live) CaptureStart(trigger, ev.time);
        // Reschedule TimeTriggerEvent for its next trigger time
        EventInsert(ev, ev.repeat);
    }
    
    static void _MotionEnable(_Triggers::MotionEnableEvent& ev) {
        _Triggers::MotionTrigger& trigger = ev.trigger();
        
        // Enable motion
        trigger.enabled.set(true);
        
        // Schedule the MotionDisable event, if applicable
        // This needs to happen before we reschedule `ev` because we need its .time to
        // properly schedule the MotionDisableEvent!
        const uint32_t durationTicks = trigger.base().durationTicks;
        if (durationTicks) {
            EventInsert((_Triggers::MotionDisableEvent&)trigger, ev.time, durationTicks);
        }
        
        // Reschedule MotionEnableEvent for its next trigger time
        EventInsert(ev, ev.repeat);
    }
    
    static void _MotionDisable(_Triggers::MotionDisableEvent& ev) {
        _Triggers::MotionTrigger& trigger = (_Triggers::MotionTrigger&)ev;
        trigger.enabled.set(false);
    }
    
    static void _MotionUnsuppress(_Triggers::MotionUnsuppressEvent& ev) {
        // We should never get a MotionUnsuppressEvent event while in fast-forward mode
        Assert(_State.live);
        _Triggers::MotionTrigger& trigger = (_Triggers::MotionTrigger&)ev;
        trigger.enabled.suppress(false);
    }
    
    static void _CaptureImage(_Triggers::CaptureImageEvent& ev) {
        // We should never get a CaptureImageEvent event while in fast-forward mode
        Assert(_State.live);
        
        constexpr MSP::ImgRingBuf& imgRingBuf = ::_State.sd.imgRingBufs[0];
        
        // Notify _TaskPower that we're performing a capture, and wait for it to sample the battery if it decided to.
        // We do this here because we want the battery sampling to complete before we turn on VDDB / VDDIMGSD and start
        // capturing an image, so that we sample the voltage while the system is quiet, instead of when the system is
        // bursting with activity, which causes lots of noise on the battery line.
        _TaskPower::CaptureNotify();
        
        const bool green = ev.capture->leds & MSP::LEDs_::Green;
        const bool red = ev.capture->leds & MSP::LEDs_::Red;
        _LEDGreen_.set(_LEDPriority::Capture, !green);
        _LEDRed_.set(_LEDPriority::Capture, !red);
        
        // Turn on VDD_B power (turns on ICE40)
        _State.vddb = true;
        
        // Wait for ICE40 to start
        // We specify (within the bitstream itself, via icepack) that ICE40 should load
        // the bitstream at high-frequency (40 MHz).
        // According to the datasheet, this takes 70ms.
        _Scheduler::Sleep(_Scheduler::Ms<30>);
        _ICEInit();
        
        // Reset SD nets before we turn on SD power
        _TaskSD::CardReset();
        _TaskSD::Wait();
        
        // Turn on IMG/SD power
        _State.vddImgSd = true;
        
        // Init image sensor / SD card
        _TaskImg::SensorInit();
        _TaskSD::CardInit();
        
        // Capture an image
        {
            // Wait until _TaskSD has initialized _State.sd (since we're about to refer to
            // _State.sd.imgRingBufs), and for any previous writing to be complete (because
            // the SDRAM is single-port, so we can't write an image to RAM until we're done
            // copying an image from RAM -> SD card).
            _Scheduler::Wait([] { return _TaskSD::SDStateReady() && !_TaskSD::Writing(); });
            
            // Capture image to RAM
            _TaskImg::Capture(imgRingBuf.buf.id);
            const uint8_t srcRAMBlock = _TaskImg::CaptureBlock();
            
            // Copy image from RAM -> SD card
            _TaskSD::Write(srcRAMBlock);
            _TaskSD::Wait();
        }
        
        _LEDGreen_.set(_LEDPriority::Capture, std::nullopt);
        _LEDRed_.set(_LEDPriority::Capture, std::nullopt);
        
        _State.vddImgSd = false;
        _State.vddb = false;
        
